import { ThikrItem } from './types';

export const MORNING_ATHKAR: ThikrItem[] = [
  {
    id: 'm1',
    text: "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
    count: 1,
    currentCount: 0,
    reference: "الترمذي"
  },
  {
    id: 'm2',
    text: "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
    count: 1,
    currentCount: 0,
    reference: "أبو داود"
  },
  {
    id: 'm3',
    text: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
    count: 100,
    currentCount: 0,
    reference: "مسلم"
  }
];

export const EVENING_ATHKAR: ThikrItem[] = [
  {
    id: 'e1',
    text: "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِير.",
    count: 1,
    currentCount: 0,
    reference: "الترمذي"
  },
  {
    id: 'e2',
    text: "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير.",
    count: 1,
    currentCount: 0,
    reference: "مسلم"
  }
];